<a href="https://colab.research.google.com/github/tastiz/projects.py/blob/master/DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [40]:
# Import the SQL ALchemy engine
from sqlalchemy import create_engine

# Database credentials
postgres_user = 'dabc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'baseball'

# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

import pandas as pd

sql = 'SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary FROM people p join salaries s on p.playerid = s.playerid'

players_df = pd.read_sql_query(sql, con=engine)

engine.dispose()

players_df.describe()

players_df = players_df.assign(bmi = (703 * players_df.weight)/(players_df.height**2))

players_df['X'] = 0

players_df_changed = players_df.drop(['X'], axis = 1)

#print('The columns of the new DataFrame')
#print(players_df_changed.columns)

#print('The columns of the original DataFrame')
#print(players_df.columns)

players_df.drop(['X'], axis = 1, inplace=True)
#print('The columns of the DataFrame after deleting inplace')
#print(players_df.columns)

#select sepecific rows with iloc returning result in multiple rows
#players_df.iloc[0]

#double brackets returns the result as a list in a single row
#players_df.iloc[[0]]

players_df.iloc[4:11]

#creates boolean values everytime the statement is True
over_200 = players_df['weight'] > 200

#counts the amount of True and False values the table holds
over_200.value_counts()

#returns the rows where the over_200 parameters are true
#players_df.iloc[over_200.values]

over_200_L_R = (players_df['weight'] > 200) & (players_df['bats'] == 'L') & (players_df['throws'] == 'R')

#select on both axis
players_df.iloc[0:10, 4:10]

cle_options = (players_df['teamid'] == 'CLE') & (players_df['yearid'] == 2015)
cle_2015 = players_df.iloc[cle_options.values, [0, 1, 4, 5, 6, 7, 8, 9, 13]]

#sorting the players by weight
weight_asc = cle_2015.sort_values(by='weight')

weight_height_asc = cle_2015.sort_values(by=['weight', 'height'])


years = (players_df['yearid'] >= 2011) & (players_df['yearid'] <= 2015)
five_years = players_df.iloc[years.values, [4,5,10,13]]

five_years = five_years.assign(fullname = five_years.namefirst + ' ' + five_years.namelast)


five_years.iloc[(five_years['fullname'] == 'Henry Blanco').values]

      namefirst namelast  yearid   salary      fullname
21454     Henry   Blanco    2011  1000000  Henry Blanco
22293     Henry   Blanco    2012  1250000  Henry Blanco
23902     Henry   Blanco    2013   750000  Henry Blanco